ETU004141_ETU004220/app/Libraries/FraisCalculatorService.php

SELECT *
FROM `tranche_frais`
WHERE `id_type_operation` = 3
AND `montant_min` <= 300
AND `montant_max` >= 300
AND `date_fin_validite` IS NULL
ORDER BY `date_debut_validite` DESC
 LIMIT 1
---
    public function calculerFrais(int $idTypeOperation, float $montant): float
    {
        $tranche = $this->trancheFraisModel
            ->where('id_type_operation', $idTypeOperation)
            ->where('montant_min <=', $montant)
            ->where('montant_max >=', $montant)
            ->where('date_fin_validite', null)
            ->orderBy('date_debut_validite', 'DESC')
            ->first();