ETU004141_ETU004220/app/Libraries/FraisCalculatorService.php

    public function calculerFrais(int $idTypeOperation, int $idOperateurConfig, float $montant): float
    {
        $tranche = $this->trancheFraisModel
            ->where('id_type_operation', $idTypeOperation)
            ->where('id_operateur_config', $idOperateurConfig)
            ->where('montant_min <=', $montant)
            ->where('montant_max >=', $montant)
            ->where('date_fin_validite', null)
            ->orderBy('date_debut_validite', 'DESC')
            ->first();
---
SELECT *
FROM `tranche_frais`
WHERE `id_type_operation` = 2
AND `id_operateur_config` = 1
AND `montant_min` <= 299.95
AND `montant_max` >= 299.95
AND `date_fin_validite` IS NULL
ORDER BY `date_debut_validite` DESC
 LIMIT 1