ETU004141_ETU004220/app/Controllers/Baremes.php

    public function listerBaremes()
    {
        $idTypeOperation   = $this->request->getGet('id_type_operation');
        $idOperateurConfig = $this->request->getGet('id_operateur_config');
        $types             = $this->typeOperationModel->findAll();
        $operateurs        = $this->operateurConfigModel->orderBy('prefixe', 'ASC')->findAll();
---
SELECT *
FROM `type_operation`
SELECT *
FROM `operateur_config`
ORDER BY `prefixe` ASC

    public function nouveauBareme()
    {
        $types      = $this->typeOperationModel->findAll();
        $operateurs = $this->operateurConfigModel->orderBy('prefixe', 'ASC')->findAll();
---
SELECT *
FROM `type_operation`
SELECT *
FROM `operateur_config`
ORDER BY `prefixe` ASC