ETU004141_ETU004220/app/Controllers/Depot.php

    public function effectuerDepot()
    {
        $montant = (float) $this->request->getPost('montant');

        if ($montant <= 0) {
            return redirect()->back()->with('erreur', 'Montant invalide');
        }

        $db = db_connect();
        $db->transStart();

        $modeleClient = new ClientModel();
        $modeleOperation = new OperationModel();

        $client = $modeleClient->find(session()->get('client_id'));
---
SELECT *
FROM `client`
WHERE `client`.`id` = 16