ETU004141_ETU004220/app/Controllers/EnvoiMultiple.php

SELECT *
FROM `client`
WHERE `client`.`id` = 16
---
    public function effectuerEnvoiMultiple()
    {
        $destinataires = $this->request->getPost('destinataires');

        if (empty($destinataires) || !is_array($destinataires)) {
            return redirect()->back()->with('erreur', 'Veuillez ajouter au moins un destinataire');
        }

        $telephoneLength = config('App')->telephoneLength;
        $modeleClient = new ClientModel();
        $modeleOperateur = new OperateurConfigModel();
        $calculateurFrais = new FraisCalculatorService();

        $source = $modeleClient->find(session()->get('client_id'));