ETU004141_ETU004220/app/Controllers/Prefixes.php

SELECT *
FROM `operateur_config`
ORDER BY `prefixe` ASC
---
    public function listerPrefixes()
    {
        $prefixes = $this->operateurConfigModel->orderBy('prefixe', 'ASC')->findAll();