ETU004141_ETU004220/app/Controllers/Solde.php

SELECT *
FROM `client`
WHERE `client`.`id` = 4
---
    public function voirSolde()
    {
        $clientId = session()->get('client_id');

        if ($clientId === null) {
            return redirect()->to('/client/connexion')->with('erreur', 'Veuillez vous connecter');
        }

        $modeleClient = new ClientModel();
        $client = $modeleClient->find($clientId);