ETU004141_ETU004220/app/Controllers/Transfert.php

    public function effectuerTransfert()
    {
        $numeroDestinataire = $this->request->getPost('numero_destinataire');
        $montant = (float) $this->request->getPost('montant');
        $fraisRetraitInclus = $this->request->getPost('frais_retrait_inclus') === '1';

        $telephoneLength = config('App')->telephoneLength;
        if (strlen($numeroDestinataire) !== $telephoneLength || !ctype_digit($numeroDestinataire)) {
            return redirect()->back()->with('erreur', "Le numero du destinataire doit contenir exactement {$telephoneLength} chiffres");
        }

        if ($montant <= 0) {
            return redirect()->back()->with('erreur', 'Montant invalide');
        }

        $modeleClient = new ClientModel();
        $modeleOperateur = new OperateurConfigModel();
        $source = $modeleClient->find(session()->get('client_id'));
---
SELECT *
FROM `client`
WHERE `client`.`id` = 16