ETU004141_ETU004220/app/Controllers/TypesOperations.php

SELECT *
FROM `type_operation`
---
    public function listerTypesOperation()
    {
        $types = $this->typeOperationModel->findAll();