ETU004141_ETU004220/app/Models/ClientModel.php

    public function rechercherParNumero(string $numero)
    {
        $numero = $this->normaliserNumero($numero);
        return $this->where('numero_telephone', $numero)->first();
---
SELECT *
FROM `client`
WHERE `numero_telephone` = '0310989098'
 LIMIT 1

    public function creerClient(string $numero)
    {
        $numero = $this->normaliserNumero($numero);
        $this->insert([
            'numero_telephone' => $numero,
            'solde' => 0,
            'statut' => 'ACTIF',
        ]);

        return $this->find($this->getInsertID());
---
INSERT INTO `client` (`numero_telephone`, `solde`, `statut`) VALUES ('0310989098', 0, 'ACTIF')
SELECT *
FROM `client`
WHERE `client`.`id` = 17

    public function mettreAJourSolde(int $id, float $nouveauSolde)
    {
        return $this->update($id, ['solde' => $nouveauSolde]);
---
UPDATE `client` SET `solde` = 199694.05
WHERE `client`.`id` IN (16)