ETU004141_ETU004220/app/Models/CommissionInteroperateurModel.php

SELECT *
FROM `commission_interoperateur`
WHERE `id_operateur_config` = 4
AND `actif` = 1
 LIMIT 1
---
    public function getCommissionParOperateur(int $idOperateurConfig): ?array
    {
        return $this->where('id_operateur_config', $idOperateurConfig)
            ->where('actif', 1)
            ->first();