ETU004141_ETU004220/app/Models/OperateurConfigModel.php

SELECT *
FROM `operateur_config`
WHERE `actif` = 1
---
    public function listerPrefixesActifs(): array
    {
        return $this->where('actif', 1)->findAll();

SELECT *
FROM `operateur_config`
WHERE `actif` = 1
---
    public function prefixeEstValide(string $numero): bool
    {
        $prefixes = $this->where('actif', 1)->findAll();

SELECT *
FROM `operateur_config`
WHERE `est_notre_operateur` = 0
AND `actif` = 1
ORDER BY `libelle` ASC
---
    public function listerOperateursExternesActifs(): array
    {
        return $this->where('est_notre_operateur', 0)
            ->where('actif', 1)
            ->orderBy('libelle', 'ASC')
            ->findAll();

SELECT *
FROM `operateur_config`
WHERE `actif` = 1
---
    public function determinerOperateur(string $numero): array
    {
        $prefixes = $this->where('actif', 1)->findAll();