ETU004141_ETU004220/app/Models/OperationModel.php

INSERT INTO `operation` (`id_type_operation`, `id_client_source`, `id_client_destination`, `montant`, `frais_appliques`, `solde_avant_source`, `solde_apres_source`, `solde_avant_destination`, `solde_apres_destination`, `statut`, `frais_retrait_inclus`, `montant_frais_retrait_inclus`) VALUES (3, 16, 17, 299.95, 6, 200000, 199694.05, 0, 299.95, 'VALIDEE', 1, 0)
---
    public function enregistrerOperation(array $donnees)
    {
        $this->insert($donnees);

SELECT `operation`.*, `type_operation`.`libelle` AS `type_libelle`, `client_source`.`numero_telephone` AS `numero_source`, `client_destination`.`numero_telephone` AS `numero_destination`
FROM `operation`
JOIN `type_operation` ON `type_operation`.`id` = `operation`.`id_type_operation`
LEFT JOIN `client` AS `client_source` ON `client_source`.`id` = `operation`.`id_client_source`
LEFT JOIN `client` AS `client_destination` ON `client_destination`.`id` = `operation`.`id_client_destination`
WHERE   (
`id_client_source` = 4
OR `id_client_destination` = 4
 )
ORDER BY `date_operation` DESC
---
    public function historiqueParClient(int $idClient, ?string $codeType = null)
{
    $builder = $this
        ->select('operation.*, type_operation.libelle AS type_libelle,
                  client_source.numero_telephone AS numero_source,
                  client_destination.numero_telephone AS numero_destination')
        ->join('type_operation', 'type_operation.id = operation.id_type_operation')
        ->join('client AS client_source', 'client_source.id = operation.id_client_source', 'left')
        ->join('client AS client_destination', 'client_destination.id = operation.id_client_destination', 'left')
        ->groupStart()
            ->where('id_client_source', $idClient)
            ->orWhere('id_client_destination', $idClient)
        ->groupEnd()
        ->orderBy('date_operation', 'DESC');

    if ($codeType !== null) {
        $builder = $builder->where('type_operation.code', $codeType);
    }

    return $builder->findAll();

SELECT `t`.`libelle` AS `type_operation`, COUNT(o.id) AS nombre_operations, SUM(o.frais_appliques) AS total_frais
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type_operation`
WHERE `o`.`statut` = 'VALIDEE'
GROUP BY `t`.`libelle`
SELECT `t`.`libelle` AS `type_operation`, CASE 
                          WHEN oc.est_notre_operateur IS NULL THEN 'Notre opérateur' 
                          WHEN oc.est_notre_operateur = 1 THEN 'Notre opérateur'
                          ELSE 'Autres opérateurs' 
                      END AS categorie_operateur, COUNT(o.id) AS nombre_operations, SUM(o.frais_appliques) AS total_frais
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type_operation`
LEFT JOIN `client` `c_dest` ON `c_dest`.`id` = `o`.`id_client_destination`
LEFT JOIN `operateur_config` `oc` ON `oc`.`prefixe` = SUBSTR(c_dest.numero_telephone, 1, 3)
WHERE `o`.`statut` = 'VALIDEE'
GROUP BY `t`.`libelle`, `categorie_operateur`
ORDER BY `t`.`libelle` ASC
---
     public function calculerGainsParType(?string $dateDebut = null, ?string $dateFin = null): array
    {
        $builder = $this->db->table('operation o')
            ->select("t.libelle AS type_operation,
                      CASE
                          WHEN oc.est_notre_operateur IS NULL THEN 'Notre opérateur'
                          WHEN oc.est_notre_operateur = 1 THEN 'Notre opérateur'
                          ELSE 'Autres opérateurs'
                      END AS categorie_operateur,
                      COUNT(o.id) AS nombre_operations, SUM(o.frais_appliques) AS total_frais")
            ->join('type_operation t', 't.id = o.id_type_operation')
            ->join('client c_dest', 'c_dest.id = o.id_client_destination', 'left')
            ->join('operateur_config oc', 'oc.prefixe = SUBSTR(c_dest.numero_telephone, 1, 3)', 'left')
            ->where('o.statut', 'VALIDEE')
            ->groupBy('t.libelle, categorie_operateur')
            ->orderBy('t.libelle', 'ASC');

        if (! empty($dateDebut)) {
            $builder->where('o.date_operation >=', $dateDebut);
        }
        if (! empty($dateFin)) {
            $builder->where('o.date_operation <=', $dateFin);
        }

        return $builder->get()->getResultArray();