ETU004141_ETU004220/app/Models/TrancheFraisModel.php

    public function listerHistoriqueTranches(?int $idTypeOperation = null, ?int $idOperateurConfig = null): array
    {
        $builder = $this;
        if ($idTypeOperation !== null) {
            $builder = $builder->where('id_type_operation', $idTypeOperation);
        }
        if ($idOperateurConfig !== null) {
            $builder = $builder->where('id_operateur_config', $idOperateurConfig);
        }
        return $builder->orderBy('date_debut_validite', 'DESC')->findAll();
---
SELECT *
FROM `tranche_frais`
ORDER BY `date_debut_validite` DESC