ETU004141_ETU004220/app/Models/UtilisateurModel.php

    public function verifierIdentifiants(string $login, string $motDePasseSaisi): ?array
    {
        $utilisateur = $this->where('login', $login)->first();
---
SELECT *
FROM `utilisateur`
WHERE `login` = 'admin'
 LIMIT 1